In [16]:
%matplotlib inline
import matplotlib
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [17]:
from datetime import datetime
from elasticsearch import Elasticsearch
es = Elasticsearch(['atlas-kibana.mwt2.org:9200'])

In [18]:
df = pd.DataFrame()

In [21]:
df.set_value("some_index", "some_column", 163)

            some_column
some_index        163.0

In [22]:
df.set_value("some_index", "some_column2", 268)

            some_column  some_column2
some_index        163.0         268.0

In [23]:
df.set_value("some_index2", "some_column2", 1248)

             some_column  some_column2
some_index         163.0         268.0
some_index2          NaN        1248.0

In [24]:
df.set_value("some_index2", "some_column3", -1)

             some_column  some_column2  some_column3
some_index         163.0         268.0           NaN
some_index2          NaN        1248.0          -1.0

In [25]:
df.set_value("some_index3", "some_column3", 987)

             some_column  some_column2  some_column3
some_index         163.0         268.0           NaN
some_index2          NaN        1248.0          -1.0
some_index3          NaN           NaN         987.0

In [26]:
df.set_value("some_index", "some_column", 631)

             some_column  some_column2  some_column3
some_index         631.0         268.0           NaN
some_index2          NaN        1248.0          -1.0
some_index3          NaN           NaN         987.0

In [27]:
print(df)

             some_column  some_column2  some_column3
some_index         631.0         268.0           NaN
some_index2          NaN        1248.0          -1.0
some_index3          NaN           NaN         987.0

In [28]:
df.to_pickle('foo.pkl')

In [32]:
aaa = pd.read_pickle('foo.pkl')

In [33]:
aaa

             some_column  some_column2  some_column3
some_index         631.0         268.0           NaN
some_index2          NaN        1248.0          -1.0
some_index3          NaN           NaN         987.0

In [34]:
aaa2 = aaa

In [35]:
aaa2.set_value("some_index3", "some_column3", 2222)

             some_column  some_column2  some_column3
some_index         631.0         268.0           NaN
some_index2          NaN        1248.0          -1.0
some_index3          NaN           NaN        2222.0

In [36]:
df

             some_column  some_column2  some_column3
some_index         631.0         268.0           NaN
some_index2          NaN        1248.0          -1.0
some_index3          NaN           NaN         987.0

In [37]:
aaa

             some_column  some_column2  some_column3
some_index         631.0         268.0           NaN
some_index2          NaN        1248.0          -1.0
some_index3          NaN           NaN        2222.0

In [38]:
aaa2

             some_column  some_column2  some_column3
some_index         631.0         268.0           NaN
some_index2          NaN        1248.0          -1.0
some_index3          NaN           NaN        2222.0

In [45]:
b = [aaa, df, aaa2]

In [48]:
b[2]

             some_column  some_column2  some_column3
some_index         631.0         268.0           NaN
some_index2          NaN        1248.0          -1.0
some_index3          NaN           NaN        2222.0

In [50]:
all = pd.DataFrame()

In [54]:
all.set_value("UChicago", "Berlin", 87)

          Berlin
UChicago    87.0

In [55]:
dict = {}

In [56]:
type(dict)

dict

In [59]:
dict['UChicago'] = {}

In [60]:
dict

{'UChicago': {}}

In [61]:
dict['UChicago']['Berlin'] = df

In [62]:
dict

{'UChicago': {'Berlin':              some_column  some_column2  some_column3
  some_index         631.0         268.0           NaN
  some_index2          NaN        1248.0          -1.0
  some_index3          NaN           NaN         987.0}}

In [65]:
type(dict['UChicago']['Berlin'])

pandas.core.frame.DataFrame

In [69]:
print('UChicago' in dict)
print('UChicago2' in dict)

True
False

In [72]:
print('Berlin' in dict['UChicago'])
print('Berlin2' in dict['UChicago'])

True
False